# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน  และหักค่าประกันสังคม 3% ของเงินเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เงินเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท

print('--------------------------------')
print('โปรแกรมคำนวณเงินเดือน')
print('--------------------------------')
Emp_ID = input('ป้อนรหัสพนักงาน:')
Emp_name = input('ป้อนชื่อพนักงาน:')
Emp_Salary = input('ป้อนเงินเดือน:')
print('---------------------------')
tax = float(Emp_Salary) * 7 / 100 
insurence = float(Emp_Salary) * 3 / 100
Emp_Salary_net = float(Emp_Salary) - tax - insurence
print(f'รหัสพนักงาน: {Emp_ID} ชื่อพนักงาน: {Emp_name} เงินเดือน: {Emp_Salary}')
print(f'หักภาษี: {tax} บาท')
print(f'หักค่าประกันสังคม: {insurence} บาท')
print(f'ต้องจ่ายเงินเดือนสุทธิ: {Emp_Salary_net} บาท')
print("----------------------------------------------")
# ใช้ ,
print('รหัสพนักงาน:', Emp_ID, 'ชื่อพนักงาน:',Emp_name, 'เงินเดือน:',Emp_Salary)
print('หักภาษี:', tax, 'บาท')
print('หักค่าประกันสังคม:', insurence, 'บาท')
print('ต้องจ่ายเงินเดือนสุทธิ:', Emp_Salary_net, 'บาท')
print('------------------------------------')
# ใช้ + 
print('รหัสพนักงาน:' + Emp_ID + 'ชื่อพนักงาน:' + Emp_name + 'เงินเดือน:' +str(Emp_Salary))
print('หักภาษี:' + str(tax) + 'บาท')
print('หักค่าประกันสังคม:' + str(insurence) + 'บาท')
print('ต้องจ่ายเงินเดือนสุทธิ:' + str(Emp_Salary_net) + 'บาท')
print('----------------------------------------')
# ใช้เทธอด format
print('รหัสพนักงาน: {} ชื่อพนักงาน: {} เงินเดือน: {}'.format(Emp_ID,Emp_name,Emp_Salary))
print('หักภาษี: {}'.format(tax))
print('หักค่าประกันสังคม: {}'.format(insurence))
print('ต้องจ่ายเงินเดือนสุทธิ: {}'.format(Emp_Salary_net))
print('--------------------------------------------------------')