#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน
# โปรแกรมคำนวณอายุจากปีเกิด (พ.ศ.)

print("****************************************")
print("**** โปรแกรมคำนวณอายุพนักงานโรงงาน ****")
print("**** พิมพ์ชื่อ SAU เพื่อหยุดทำงาน ****")
print("****************************************")

import datetime
current_year = datetime.datetime.now().year + 543   # ปีปัจจุบัน (พ.ศ.)

while True:
    name = input("ป้อนชื่อพนักงาน : ")

    if name.upper() == "SAU":
        print("สิ้นสุดการทำงานของโปรแกรม")
        break

    birth_year = int(input("ป้อนปีเกิด (พ.ศ.) : "))
    age = current_year - birth_year

    print("คุณ", name, "มีอายุ", age, "ปี")
    print("****************************************")
