# โปรแกรมทายตัวเลข

print("****************************************")
print("**** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****")
print("****************************************")

secret_number = 69

while True:
    guess = int(input("ป้อนตัวเลขที่ต้องการทาย : "))

    if guess == secret_number:
        print("ยินดีด้วยคุณทายถูก")
        print("*****************************************")
        break
    elif guess > secret_number:
        print("คุณทายผิดตัวเลขที่ป้อนมากไป")
        print("*****************************************")
    else:
        print("คุณทายผิดตัวเลขที่ป้อนน้อยไป")
        print("*****************************************")
