# โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน
# โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน

print("**************************************")
print("**** โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน ****")
print("**************************************")

while True:

    num1 = int(input("ป้อนตัวเลขตัวที่ 1 : "))
    num2 = int(input("ป้อนตัวเลขตัวที่ 2 : "))

    product = num1 * num2

    print("ผลคูณของ " + str(num1) + " x " + str(num2) + " = " + str(product))
    print("**************************************")

    # ตรวจสอบเงื่อนไขหยุด
    if product > 5000:
        print("ผลคูณมีค่ามากกว่า 5000 โปรแกรมหยุดทำงาน")
        break
