# Assignment Operator กำหนดค่า คือ เครื่องหมายเท่ากับ = 
# การทำงานของ = คือ เอาทางขวาไปใส่ทางซ้าย
# ยกเว้นเสียแต่ว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (variable) = ข้อมูล (data)/นิพจน์ (Expression)12
# *** ตัวแปร (variable) คือ ฃื่อที่ dev. ตั้งขึ้นมาเองเก็บไว้ใช้ข้อมูล
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บข้อมูลมาใช้ ***

score = 20
fullname = 'สมชาย'
salary = input('ป้อนเงินเดือน:')
sum = 20 + 30
print('----------------------')
num = 10
# ตัวดำเนินการกำหนดค่าอย่างย่อ
num += 10 # num = num + 10
num -= 10 # num = num - 10
num *= 2 # num = num * 2
num /= 2 # num = num / 2 
num %= 2 # num = num % 2 
num //= 2 # num = num // 2
print(num)
print('------------------------')